---
kind: method
id: M:Autodesk.Revit.DB.FailureMessageKey.op_Inequality(Autodesk.Revit.DB.FailureMessageKey,Autodesk.Revit.DB.FailureMessageKey)
source: html/93eb4d33-62bc-3146-d4eb-ede56ff150a6.htm
---
# Autodesk.Revit.DB.FailureMessageKey.op_Inequality Method

Determines whether two FailureMessageKeys are different.

## Syntax (C#)
```csharp
public static bool operator !=(
	FailureMessageKey first,
	FailureMessageKey second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.FailureMessageKey`) - The first FailureMessageKey.
- **second** (`Autodesk.Revit.DB.FailureMessageKey`) - The second FailureMessageKey.

## Returns
True if the FailureMessageKeys are different; otherwise, false.